"""1. Створити клас Calc, який буде мати атребут last_result та 4 методи.
 Методи повинні виконувати математичні операції з 2-ма числами, а саме
  додавання, віднімання, множення, ділення.
- Якщо під час створення екземпляру класу звернутися до атребута last_result
 він повинен повернути пусте значення.
- Якщо використати один з методів - last_result повенен повернути результат
 виконання ПОПЕРЕДНЬОГО методу.
    Example:
    last_result --> None
    1 + 1
    last_result --> None
    2 * 3
    last_result --> 2
    3 * 4
    last_result --> 6
    ...
- Додати документування в клас (можете почитати цю статтю:
https://realpython.com/documenting-python-code/ )"""