'''4. Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді
 коду Морзе та виводить декодоване значення (латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensetive (на ваш розсуд - велики чи
     маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки
    тощо використовуватися не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .

    '''


def morse_code(input_string):
    morse_dict = {
        ".-": "A",
        "-...": "B",
        "-.-.": "C",
        "-..": "D",
        ".": "E",
        "..-.": "F",
        "--.": "G",
        "....": "H",
        "..": "I",
        ".---": "J",
        "-.-": "K",
        ".-..": "L",
        "--": "M",
        "-.": "N",
        "---": "O",
        ".--.": "P",
        "--.-": "Q",
        ".-.": "R",
        "...": "S",
        "-": "T",
        "..-": "U",
        "...-": "V",
        ".--": "W",
        "-..-": "X",
        "-.--": "Y",
        "--..": "Z",
        "...---...": "SOS"
    }

    words = input_string.split('   ')
    decoded_message = ''

    for word in words:
        letters = word.split(' ')
        for letter in letters:
            decoded_message += morse_dict.get(letter, '')
        decoded_message += ' '

    return decoded_message


print(morse_code('--. . . -.- .... ..- -...   .. ...   .... . .-. .'))
print(morse_code('...---...'))
print(morse_code(".... . .-.. .-.. ---   .-- --- .-. .-.. -.."))