''' 1. Створіть функцію, всередині якої будуть записано список із п'яти
 користувачів (ім'я та пароль). Функція повинна приймати три аргументи:
 два - обов'язкових (<username> та <password>) і третій - необов'язковий
 параметр <silent> (значення за замовчуванням - <False>).
Логіка наступна:
    якщо введено коректну пару ім'я/пароль - вертається True;
    якщо введено неправильну пару ім'я/пароль:
        якщо silent == True - функція вертає False
        якщо silent == False -породжується виключення LoginException
         (його також треба створити =))
'''