"""1. Написати функцiю season, яка приймає один аргумент (номер мiсяця вiд 1 до 12) та яка буде повертати пору року,
якiй цей мiсяць належить (зима, весна, лiто або осiнь). У випадку некоректного введеного значення - виводити
 відповідне повідомлення."""

def season(month):
    if month in (12, 1, 2):
        return "Зима"
    elif month in (3, 4, 5):
        return "Весна"
    elif month in (6, 7, 8):
        return "Літо"
    elif month in (9, 10, 11):
        return "Осінь"
    else:
        return "Некоректне значення місяця. Введіть число від 1 до 12."

try:
    print(season(int(input("Введіть номер місяця (підказка від 1 до 12): "))))
except ValueError:
    print("Некоректне значення місяця. Введіть число від 1 до 12.")


